Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/dismissal/unfair_dismissal.html.txt.tmx
Source language: en
Languages: ga

source: • Contributory conduct - a calculation that will take into account any conduct by you that contributed to the dismissal, even though it was an unfair dismissal
ga: • Iompraíocht ranníocach - ríomh a thógfaidh san áireamh aon iompraíocht uait a chuir leis an dífhostú, cé gur dífhostú éagórach a bhí i gceist

source: The degree of contribution will be stated in percentage terms and your award overall award reduced accordingly
ga: Sonrófar méid na héifeachta seo i dtéarmaí céatadáin agus laghdófar an bronnadh iomlán ort dá réir

source: If you wish to make a claim for unfair dismissal you should do so within 6 months of the date of dismissal
ga: Más mian leat éileamh a dhéanamh ar dhífhostú éagórach ba chóir duit é seo a dhéanamh laistigh de 6 mhí ó dháta an dífhostaithe

source: This time limit may be extended to 12 months if there was "reasonable cause" for the delay
ga: D'fhéadfaí an teorainn ama seo a leathnú go 12 mí i gcásanna nuair a chuir cúinsí réasúnacha cosc ar an éileamh a bheith déanta laistigh de 6 mhí

source: You should make your complaint to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Caithfidh tú d'éileamh a dhéanamh leis an gCoimisiún um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: Complaints will be referred to an adjudication officer for hearing
ga: Cuirfidh gearán faoi bhráid breithneora an Choimisiúin um Chaidreamh san Áit Oibre

source: All decisions of an adjudication officer can be appealed to the Labour Court
ga: Tá ceart achomharc a dhéanamh ag an gCúirt Oibreachais ar cinneadh an bhreithneora

source: For information on seeking redress under the Acts contact Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
ga: Déan teagmháil leis na tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre chun sásamh faoi na hAchtanna a fháil

source: Information and Customer Service
ga: Seirbhíse Faisnéise agus Custaiméara

source: Opening Hours: Mon. to Fri. 9.30am to 5pm
ga: Uaireanta Oscailte:Luan go hAoine 9.30rn go 5in

source: Tel: (059) 917 8990
ga: Teil: (059) 917 8990

source: Locall: 1890 80 80 90
ga: Lóghlao: 1890 80 80 90

source: Fixed-term or specified-purpose contracts and dismissal
ga: Breis faisnéise: Conarthaí ar théarma seasta nó cuspóir-shonraithe agus dífhostú

source: A fixed-term contract is a contract of a specific length where the duration of the contract is known to both parties from the outset
ga: Is conradh d'fhad ar leith é conradh ar théarma seasta nuair atá tréimhse an chonartha ar eolas ag an dá pháirtí ón tús

source: A specified-purpose contract is also of a limited duration, but the parties do not know the length of the contract from the outset
ga: Tá tréimhse theoranta ag baint le conradh cuspóir-shonraithe chomh maith, ach nach bhfuil fad an chonartha ar eolas ag an dá pháirtí ón tús

source: It will be envisaged that it is of limited duration to end when the specified purpose of the contract is completed
ga: Feictear go mbeidh sé teoranta ó thaobh ama agus go gcríochnóidh sé nuair a bheidh cuspóir shonraithe an chonartha comhlánaithe

source: When an employee is dismissed at the end of a fixed-term or specified-purpose contract the unfair dismissals legislation applies as normal unless the employer has availed of the provision to exclude the operation of the legislation
ga: Nuair a dhífhostaítear fostaí ag deireadh conartha ar théarma seasta nó cuspóir-shonraithe, baineann an reachtaíocht um dhífhostú éagórach mar is gnách murar bhain an fostóir leas as an bhforáil oibriú na reachtaíochta a eisiamh

source: The 3 conditions to be met in order to bring this exclusion into play are:
ga: Is iad na trí coinníollacha a gcaithfear cloí leo ionas gur féidir an t-eisiamh seo a chur i bhfeidhm ná:

source: • The contract must be in writing and must set out the specific duration of the fixed-term contract or, in the case of a specified-purpose contract, the object of the contract
ga: • Caithfidh an conradh a bheith i scríbhinn agus caithfear tréimhse shonrach an chonartha ar théarma seasta a leagan amach nó, i gcás an chonartha chuspóir-shonraithe, cuspóir an chonartha a leagan amach

source: • The contract must be signed by both the employee and the employer
ga: • Caithfidh an fostaí agus an fostóir araon an conradh a shíniú

source: • The contract must contain a specific clause stating that the Unfair Dismissals Acts will not apply to the expiry of the term of the contract
ga: • Caithfidh an conradh foráil shonrach a chuimsiú ag rá nach mbaineann na hActanna um Dhífhostú Éagórach le héag théarma an chonartha

source: If these conditions are not met then you may have a claim for unfair dismissal despite the fact that you are employed under a fixed-term or specified-purpose contract, subject to fulfilling the normal requirements as to length of service, etc
ga: Mura gcloítear leis na coinníollacha seo, b'fhéidir go bhféadfá éileamh a dhéanamh ar dhífhostú éagórach cé go bhfuil tú fostaithe faoi chonradh ar théarma seasta nó cuspóir-shonraithe, ag brath ar ghnáthriachtanais maidir le fad seirbhíse, etc. a chomhlíonadh

source: Under the Protection Of Employees (Fixed-Term Work) Act 2003 (pdf), if an employee is required to enter into a number of such fixed-term or specified-purpose contracts there are two possible situations as follows:
ga: Faoin Acht um Chosaint Fostaithe (Obair ar Théarma Seasta) 2003 (pdf), má tá riachtanas ar fhostaí iontráil isteach i líon áirithe de chonarthaí ar théarma seasta nó cuspóir-shonraithe, tá dhá chás fhéideartha mar a leanas:

source: • Employees on fixed-term contracts which commenced prior to the passing of the Act: Once such an employee completes or has completed 3 years' continuous employment (any or all of the 3 years' service may have occurred prior to the passing of the Act) the employer may renew the contract for a fixed term on one occasion only and that renewal may be for a period of no longer than one year
ga: • Fostaithe ar chonarthaí ar théarmaí seasta a thosaigh roimh inachtú an Achta: Chomh luath agus atá trí bliana de sheirbhís leanúnach fostaíochta comhlánaithe ag fostaí mar seo (d'fhéadfadh aon chuid nó an chuid ar fad den tseirbhís trí bliana tarlú roimh inachtú an Achta) is féidir leis an bhfostóir an conradh a athnuachan do théarma seasta babhta amháin agus ní féidir leis an tréimhse a bheith níos faide ná bliain amháin

source: • Employees on a fixed-term employment contract which commenced after the passing of the Act: Where such an employee is employed by his or her employer or associated employer on two or more continuous fixed-term contracts, the aggregate duration of those contracts may not exceed 4 years
ga: • Fostaithe ar chonarthaí ar théarmaí seasta a thosaigh tar éis inachtú an Achta: Nuair atá fostaí mar seo fostaithe ag a f(h)ostóir nó fostóir gaolmhar ar dhá cheann nó níos mó de chonarthaí leanúnacha ar théarma seasta, ní féidir leis an tréimhse chomhiomlán a bhaineann leis na conarthaí sin a bheidh níos faide ná ceithre bliana

source: However, the above-mentioned rules do not apply where there are objective grounds justifying the renewal of a contract of employment for a fixed term only
ga: Ní bhaineann na rialacha thuas, áfach, nuair atá cúiseanna oibiachtúla a thugann údar le hathnuachan an chonartha fostaíochta ar théarma seasta amháin

source: Where a renewal of a fixed-term contract does not comply with the above requirements and cannot be objectively justified, the contract is treated as an open-ended contract
ga: Nuair nach gcloíonn athnuachan conartha ar théarma seasta leis na riachtanais thuas agus nach bhfuil údar oibiachtúil leis, déileáiltear leis an gconradh mar chonradh oscailte

source: The Unfair Dismissal Acts contain a provision aimed at ensuring that successive temporary contracts are not used in order to avoid that legislation
ga: Cuimsíonn na hAchtanna um Dhífhostú Éagórach foráil a bhfuil sé mar aidhm aici a chinntiú nach n-úsáidtear conarthaí leanúnacha sealadacha chun an reachtaíocht sin a sheachaint

source: Where a fixed-term or specified-purpose contract expires and the individual is re-employed within 3 months, the individual is deemed to have continuous service
ga: Nuair a éagann conradh ar théarma seasta nó cuspóir-shonraithe agus athfhostaítear an duine laistigh de thrí mhí, meastar go bhfuil seirbhís leanúnach ag an duine sin

source: Therefore, even where an employer excludes the unfair dismissals legislation in the manner described above, an adjudicator will consider whether the use of such contracts was wholly or partly to avoid the employee having the protection of the unfair dismissals legislation
ga: Dá réir sin, fiú amháin má dhéanann an fostóir an reachtaíocht um dhífhostú éagórach a eisiamh mar atá cur síos air thuas, déanfaidh breithneoir a mheas ar úsáideadh conarthaí mar seo go hiomlán nó de chuid chun cosaint an fhostaí a sheachaint mar a bhaineann sí le reachtaíocht um dhífhostú éagórach

source: If it is considered that this was the case and the contracts were not separated by more than 3 months and the job was at least similar, then the case can be dealt with as if there was continuous employment and the employer will be required to justify the dismissal in the normal manner
ga: Má mheastar gurbh amhlaidh a bhí agus nár scaradh na conarthaí de thréimhsí níos mó na trí mhí agus go raibh na poist cosúil lena chéile ar a laghad, is féidir déileáil leis an gcás amhail is go raibh fostaíocht leanúnach i gceist, agus beidh ar an bhfostóir údar an dífhostaithe a mhíniú mar is gnách
